In [1]:
# Pandas 라이브러리 불러오기
import pandas as pd

# Customer 데이터 읽기
customer = pd.read_csv('/Users/geonseunglee/Desktop/R/github/R_n_Python/data/Customer.csv')
customer.head() # 첫 5행 확인

   customer_Id         DOB Gender  city_code
0       268408  02-01-1970      M        4.0
1       269696  07-01-1970      F        8.0
2       268159  08-01-1970      F        8.0
3       270181  10-01-1970      F        2.0
4       268073  11-01-1970      M        1.0

In [2]:
print(len(customer)) # 데이터 총 행 수 확인

5647

In [3]:
# 전체적인 데이터 구조 확인
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5647 entries, 0 to 5646
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_Id  5647 non-null   int64
 1   DOB          5647 non-null   object
 2   Gender       5645 non-null   object
 3   city_code    5645 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 176.6+ KB

In [4]:
# Transactions 데이터 읽기
transactions = pd.read_csv('/Users/geonseunglee/Desktop/R/github/R_n_Python/data/Transactions.csv')
transactions.head() # 첫 5행 확인

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,80712190438,270351,28-02-2014,1,1,-5,-772,405.300,-4265.300,e-Shop
1,29258453508,270384,27-02-2014,5,3,-5,-1497,785.925,-8270.925,e-Shop
2,51750724947,273420,24-02-2014,6,5,-2,-791,166.110,-1748.110,TeleShop
3,93274880719,271509,24-02-2014,11,6,-3,-1363,429.345,-4518.345,e-Shop
4,51750724947,273420,23-02-2014,6,5,-2,-791,166.110,-1748.110,TeleShop

In [5]:
print(len(transactions)) # 데이터 총 행 수 확인

23053

In [6]:
# 전체적인 데이터 구조 확인
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23053 entries, 0 to 23052
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    23053 non-null  int64
 1   cust_id           23053 non-null  int64
 2   tran_date         23053 non-null  object
 3   prod_subcat_code  23053 non-null  int64
 4   prod_cat_code     23053 non-null  int64
 5   Qty               23053 non-null  int64
 6   Rate              23053 non-null  int64
 7   Tax               23053 non-null  float64
 8   total_amt         23053 non-null  float64
 9   Store_type        23053 non-null  object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.8+ MB

In [7]:
# prod_cat_info 데이터 읽기 (카테고리 정보)
prod_cat_info = pd.read_csv('/Users/geonseunglee/Desktop/R/github/R_n_Python/data/prod_cat_info.csv')
prod_cat_info.head() # 첫 5행 확인

   prod_cat_code  prod_cat  prod_sub_cat_code prod_subcat
0              1  Clothing                  4        Mens
1              1  Clothing                  1       Women
2              1  Clothing                  3        Kids
3              2  Footwear                  1        Mens
4              2  Footwear                  3       Women

In [8]:
print(len(prod_cat_info)) # 데이터 총 행 수 확인

23

In [9]:
# 전체적인 데이터 구조 확인
prod_cat_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   prod_cat_code      23 non-null     int64
 1   prod_cat           23 non-null     object
 2   prod_sub_cat_code  23 non-null     int64
 3   prod_subcat        23 non-null     object
dtypes: int64(2), object(2)
memory usage: 864.0+ bytes